fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого СтрокаТч из Выплаты Цикл 
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = СтрокаТч.Сотрудник;
		Движение.Сумма = СтрокаТч.Сумма; 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Регистратор = Ссылка; 
   
	КонецЦикла;

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
			
	Выплаты.Очистить();
	Сообщить("Выплаты успешно начислены");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_ВыполнитьАвтозаполнение() Экспорт 
   	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	
	Запрос.УстановитьПараметр("Период",Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Выплаты.Очистить();
	
	ТаблицаЗначенийЗаполнения = Новый ТаблицаЗначений;
	ТаблицаЗначенийЗаполнения.Колонки.Добавить("Сотрудник");
	ТаблицаЗначенийЗаполнения.Колонки.Добавить("Сумма");
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСторка = ТаблицаЗначенийЗаполнения.Добавить();
		НоваяСторка.Сотрудник = Выборка.Сотрудник;
		НоваяСторка.Сумма = Выборка.СуммаОстаток;  
		
	КонецЦикла; 
	
	ЭтотОбъект.Дата = ТекущаяДата();
    Возврат ТаблицаЗначенийЗаполнения;  
	
КонецФункции
               
#КонецОбласти

#КонецЕсли
